var banner = new Array();
banner[0]= "<p>اللهم رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.</p><footer>(متفق عليه)</footer>";
banner[1]= "<p>اللهم آت نفسي تقواها، و زكها أنت خير من زكاها، أنت وليها ومولاها. اللهم إني أعوذ بك من علم لا ينفع، ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعوة لا يستجاب لها.</p><footer>(رواه مسلم)</footer>";
banner[2]= "<p>اللهم إني أعوذ بك من شر ماعملت ومن شر مالم أعمل.</p><footer><cite title='(رواه مسلم)'>(رواه مسلم)</cite></footer>";
banner[3]= "<p>اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك.</p><footer><cite title='(رواه مسلم)'>(رواه مسلم)</cite></footer>";
banner[4]= "<p>اللهم إني أعوذ بك من الهدم، وأعوذ بك من التردي، وأعوذ بك من الغرق والحرق والهرم، وأعوذ بك أن يتخبطني الشيطان عند الموت، وأعوذ بك أن أموت في سبيلك مدبرًا، وأعوذ بك أن أموت لديغًا.</p><footer><cite title='(رواه النسائي، وأبو داود)'>(رواه النسائي، وأبو داود)</cite></footer>";
banner[5]= "<p>اللهم أعنا على ذكرك، وشكرك، وحسن عبادتك</p><footer><cite>رواه ا لحاكم وصححه ووافقه الذهبي</cite> وهو كما قالا وهو عند أبي داود والنسائي أن النبي صلى الله عليه وسلم أوصى معاذاً أن يقولها في دبر كل صلاة.</footer>";
banner[6]="<p>اللهم لك الحمد كله، اللهم لا قابض لما بسطت، ولا باسط لما قبضت، ولا هادي لمن أضللت ولا مضل لمن هديت، ولا معطي لما منعت ولا مانع لما أعطيت، ولا مقرب لما باعدت، ولا مباعد لما قربت، اللهم ابسط علينا من بركاتك ورحمتك وفضلك ورزقك، اللهم إني أسألك النعيم المقيم الذي لا يحول ولا يزول، اللهم إني أسألك النعيم يوم العيلة، والأمن يوم الخوف، اللهم إني عائذ بك من شر ما أعطيتنا وشر ما منعتنا، اللهم حبب إلينا الإيمان وزينه في قلوبنا وكره إلينا الكفر والفسوق والعصيان واجعلنا من الراشدين، اللهم توفنا مسلمين، وأحينا مسلمين، وألحقنا بالصالحين غير خزايا ولا مفتونين، اللهم قاتل الكفرة الذين يكذبون رسلك ويصدون عن سبيلك، واجعل عليهم رجزك وعذابك، اللهم قاتل الكفرة الذين أوتوا الكتاب؛ إله الحق<footer><cite title='رواه أحمد بلفظه و البخاري في الأدب المفرد وصححه الألباني في تخريج فقه السيرة'>رواه أحمد بلفظه و البخاري في الأدب المفرد وصححه الألباني في تخريج فقه السيرة</cite></footer></p>"
var idx = Math.floor(Math.random() * banner.length);
var delay = 50000;
		
tday  =new Array("الأحد","الأثنين","الثلاثاء","الأربعاء","الخميس","الجمعة","السبت");
tmonth=new Array("يناير","فبراير","مارس","إبريل","مايو","يونيو","يوليو","أغسطس","سبتمبر","أكتوبر","نوڤمبر","ديسيمبر");

function changeBanner(){
	idx = (idx == banner.length - 1) ? 0 : ++idx;
	document.getElementById('changeline').innerHTML = banner[idx];
}

function GetClock(){
	d = new Date();
	nday   = d.getDay();
	nmonth = d.getMonth();
	ndate  = d.getDate();
	nyear = d.getYear();
	if(nyear<1000) nyear=nyear+1900;
	document.getElementById('clockbox').innerHTML=""+tday[nday]+" "+ndate+" "+tmonth[nmonth]+" "+nyear+"";
	setTimeout("GetClock()", 1000);
}
		
onload = function(){
	GetClock();
	changeBanner();
	setInterval('changeBanner()', delay);
}